Write a query that calculates the difference between the highest salaries found in the marketing and engineering departments. Output just the absolute difference in salaries.

https://platform.stratascratch.com/coding/10308-salaries-differences?code_type=1

In [1]:
import pandas as pd

In [2]:
dropbox_salary_dept = pd.read_csv('data/dropbox_salary_department.csv')
dropbox_salary_dept = dropbox_salary_dept[['department', 'salary']]
dropbox_salary_dept.head()

    department  salary
0  engineering   19945
1  engineering   33575
2  engineering   34902
3  engineering   15947
4  engineering   27006

In [3]:
max_eng_salary = dropbox_salary_dept[dropbox_salary_dept["department"] == 'engineering']
max_eng_salary = max_eng_salary.groupby('department').max('salary').reset_index()
max_eng_salary = max_eng_salary.rename(columns = {'salary': 'max_salary'})

max_eng_salary

    department  max_salary
0  engineering       45787

In [4]:
max_mark_salary =dropbox_salary_dept[dropbox_salary_dept["department"]=='marketing']
max_mark_salary = max_mark_salary.groupby('department').max('salary').reset_index()
max_mark_salary = max_mark_salary.rename(columns = {'salary': 'max_salary'})

max_mark_salary

  department  max_salary
0  marketing       48187

In [5]:
result = abs(pd.DataFrame(max_eng_salary['max_salary'] - max_mark_salary['max_salary']))
result.columns = ['salary_difference']

result

   salary_difference
0               2400